package oop0430;

public class Test01_welcome {

	public static void main(String[] args) {
		
		//주석문(보충설명문)
		//한줄주석
		/* 여러줄 주석*/
		/*
			● 이클립스 사용법
			  - 글자크기      Shift + Ctrl + +/-
			  - 자바클래스 실행 Ctrl + F11
			  - 명령어 불러오기 Ctrl + space
			  - 자바소스(.java)를 저장하면 자동으로 컴파일 된다
		 */
///////////////////////////////////////////////////////		
		/*
			● 자바의 기본 규칙
			  - 대소문자를 구분한다
			  - 한줄 종결문자 ;
			  - 자바클래스명의 첫글자는 대문자로 한다

		    ● 식별자 작성 규칙
		      - 식별자 : 프로젝트명 basicJava
		               팩키지명  oop0430
		               클래스명  Test01_welcome
		               변수명, 함수명의 이름들 
		      - 의미를 부여한다
		      - 한글, 공백은 절대 사용 불가
		      - 첫글자로 숫자 사용 불가
		      - 단어가 조합이 되는 경우 첫글자는 있도록 대문자로 한다
		        예)basicJava, HelloWorld, ~~		
		*/

	}

}
